#ifndef INC__TASK_H
#define INC__TASK_H

//Дана квадратная матрица, все элементы которой различны. Поменять местами
//строки, в которых находятся максимальный и минимальный элементы.
//TASK 1 //////////////////////////////////////
void task1();

//Упорядочить строки матрицы по неубыванию наибольших элементов строк:
//TASK 2 //////////////////////////////////////
void task2();

//Дана прямоугольная матрица. Упорядочить столбцы матрицы по неубыванию
//минимальных элементов столбцов:
//TASK 3 //////////////////////////////////////
void task3();

//Если данная квадратная матрица 𝐴 симметрична, то заменить 𝐴 ее квадратом
//TASK 4 //////////////////////////////////////
void task4();

//Дана квадратная матрица. Если среди сумм элементов строк матрицы нет равных,
// то транспонировать матрицу.
//TASK 5 //////////////////////////////////////
void task5();

//Даны две квадратные матрицы 𝐴 и 𝐵. Определить, являются ли они взаимно
//обратными (𝐴 = 𝐵−1)
//TASK 6 //////////////////////////////////////
void task6();

//Дана прямоугольная матрица. Назовем псевдодиагональю множество элементов этой матрицы,
// лежащих на прямой, параллельной прямой, содержащей элементы 𝑎𝑖,𝑖.
// Найти сумму максимальных элементов всех псевдодиагоналей данной матрицы.
//TASK 7 //////////////////////////////////////
void task7();

//Дана прямоугольная матрица, все элементы которой различны.
// Найти минимальный элемент матрицы в выделенной области:
//TASK 8 //////////////////////////////////////
void task8();

//Дано 𝑛 точек в 𝑚-мерном пространстве. Упорядочить точки по неубыванию их
//расстояний до начала координат.
//TASK 9 //////////////////////////////////////
void task9();

//Определить количество классов эквивалентных строк данной прямоугольной
//матрицы. Строки считать эквивалентными, если равны суммы их элементов.
//TASK 10 //////////////////////////////////////
void task10();

//Дана квадратная матрица. Определить 𝑘 – количество "особых" элементов матрицы,
//считая элемент "особым" если он больше суммы остальных элементов своего столбца.
//TASK 11 //////////////////////////////////////
void task11();

//Дана квадратная матрица. Заменить предпоследнюю строку матрицы первым
//из столбцов, в котором находится минимальный элемент матрицы.
//TASK 12 //////////////////////////////////////
void task12();

//Дан массив квадратных матриц. Определить число матриц, строки которых
//упорядочены по неубыванию элементов.
//TASK 13 //////////////////////////////////////
void task13();

//Дан массив целочисленных матриц. Вывести матрицы, имеющие наибольшее
//число нулевых строк
//TASK 14 //////////////////////////////////////
void task14();

//Дан массив вещественных квадратных матриц. Вывести матрицы с наименьшей
//нормой. В качестве нормы матрицы взять максимум абсолютных величин ее элементов.
//TASK 15 //////////////////////////////////////
void task15();

//Дана матрица. Определить 𝑘 – количество "особых" элементов данной матрицы,
// считая элемент "особым" если в строке слева от него находятся меньшие
//элементы, а справа – бoльшие:
//TASK 16 //////////////////////////////////////
void task16();

//Каждая строка данной матрицы представляет собой координаты вектора в
//пространстве. Определить, какой из этих векторов образует максимальный угол
//с данным вектором 𝑣.
//TASK 17 //////////////////////////////////////
void task17();

//Дана вещественная квадратная матрица, все элементы которой различны.
//Найти скалярное произведение строки, в которой находится наибольший элемент матрицы,
// на столбец с наименьшим элементом.
//TASK 18 //////////////////////////////////////
void task18();

void task();

#endif
